---
type: StructuralSectionZProfileWithLips
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionZProfileWithLips

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfileWithLips` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionZProfileWithLips | 2016 | `public StructuralSectionZProfileWithLips ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double princ` |